#!/usr/bin/python3
#-*- coding:utf-8 -*-

if __name__ == "__main__":
    # 转化为Ascall码
    a = '%c %c' % (97,98)
    print (a)

    # 格式化字符串类型
    b = 90
    a1 = '%s' % b
    print (a1)
    print (type(b))
    print (type(a1))

    # 格式化整数类型
    a2 = '%d' % 20.56
    print (a2)

    # 格式化8进制
    a3 = '%o' % 123
    print (a3)

    # 格式化为16进制
    a4 = '%x' % 1232323395946
    print (a4)

    # 格式化为16进制大写
    a5 = '%X' % 123213123123547788769
    print (a5)

    # 格式化为浮点数
    a6 = '{0:.1f}'.format(23.68)
    a7 = '%f' % 123
    print (a6)
    print (a7)

    # 格式化e单位
    print (1e3)
    a8 = '%e' % 1213123124324.21313
    print (a8)

    #  合理化格式化单位选择 %f or %e
    a9 = '%g' % 12123123.123
    print (a9)

# # 格式化辅助命令

    # m( 占用格式大小 ).n( 保留几位小数 )
    a10 = '%10.1f' % 273.233
    print (a10)

    # -左对齐
    a11 = '%-10.1f' % 123.2
    print (a11)

    # 显示正号
    a12 = '%+d' % 12
    print (a12)

    # 加入#可以识别0o为8进制, 0x为16进制
    a13 = '%#o' % 1231412
    a14 = '%#x' % 123120987
    print (a13 + '\n'+ a14)

    # 0表示空格替换成0
    a15 = '%010d' % 123
    print(a15)